// /* ************************************************************************** */
// /*                                                                            */
// /*                                                        :::      ::::::::   */
// /*   constParam.c                                       :+:      :+:    :+:   */
// /*                                                    +:+ +:+         +:+     */
// /*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
// /*                                                +#+#+#+#+#+   +#+           */
// /*   Created: 2023/12/12 20:58:51 by daehlee           #+#    #+#             */
// /*   Updated: 2023/12/12 21:00:04 by daehlee          ###   ########.fr       */
// /*                                                                            */
// /* ************************************************************************** */

// /* 상수를 인자로 받아들이기 */
// #include <stdio.h>
// int read_val(const int val);
// int main() {
// 	int a;
// 	scanf("%d", &a);
// 	read_val(a);
// 	return 0;
// }
// int read_val(const int val) {
// 	val = 5; // 허용되지 않는다.
// 	return 0;
// }