/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   celsiusToFahrenheit.c                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/11/30 16:46:22 by daehlee           #+#    #+#             */
/*   Updated: 2023/11/30 16:48:20 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
int main()
{
	double celsius; // 섭씨 온도

	printf("섭씨 온도를 화씨 온도로 바꿔주는 프로그램 입니다. \n");
	printf("섭씨 온도를 입력 해주세요 : ");
	scanf("%lf", &celsius); // 섭씨 온도를 입력 받는다.

	printf("섭씨 %f 도는 화씨로 %f 도 입니다.\n", celsius, 9 * celsius / 5 + 32);

	return 0;
}