/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   15-3subject.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/18 16:57:29 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/18 17:00:45 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
	생각해보기
*/

/*
	문제 1
	길이가 최대 100인 문자열을 하나 입력 받아서 문자열을 역순으로 출력하는 함수를 만드시오.
*/

/*
	문제 2
	길이가 최대 100인 문자열을 입력 받아서 소문자는 대문자로, 대문자는 소문자로 출력하는 함수를
	만들어보시오
*/

/*
	문제 3
	두 개의 문자열을 입력 받아서 같다면 "같다", 다르면 "다르다" 라고 출력하는 함수를 만들어보세요.
*/

/*
	문제 4
	문자열을 두 개 입력 답아서 먼저 입력받은 문자열에서 나중에 입력받은 문자열의 위치를 검색하는 함수를 만들어 보시오.
	만일 없다면 -1 을 리턴, 있다면 그 위치를 리턴
*/

/*
	문제 5
	도서 관리 프로그램을 만들어 보자. 프로그램에는 다음과 같은 기능들이 구현되어야 한다.

	1. 책을 새로 추가하는 기능 (책의 총 개수는 100권. 이 때, 각 책의 정보는 제목, 저자의 이름, 출판사로 한다.)
	2. 책의 제목을 검색하면 그 책의 정보가 나와야 한다.
	3. 위와 마찬가지로 저자, 출판사 검색 기능이 있어야한다.
	4. 책을 빌리는 기능.
	5. 책을 반납하는 기능.
*/