/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   becareful%c.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/18 15:51:23 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/18 15:53:12 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 마지막 stdin 예제 */
#include <stdio.h>
int main()
{
	char str1[10], str2[10];

	printf("문자열을 입력하세요 : ");
	scanf("%s", str1);
	printf("입력한 문자열 : %s \n", str1);

	printf("문자열을 입력하세요 : ");
	scanf("%s", str2);
	printf("입력한 문자열 : %s \n", str2);

	return 0;
}