/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   inputString.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/18 15:27:44 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/18 15:29:42 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 문자열 입력 */
#include <stdio.h>
int main()
{
	char words[30];

	printf("30 자 이내의 문자열을 입력해주세요! : ");
	scanf("%s", words);

	printf("문자열 : %s \n", words);

	return 0;
}