/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   reviewPointer.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/18 15:01:34 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/18 15:02:41 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 포인터 간단 복습 */
#include <stdio.h>
int main()
{
	char word[30] = {"long sentence"};
	char *str = word;

	printf("%s \n", str);

	return 0;
}