/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   weirdScanf.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/18 15:36:35 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/18 15:37:34 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*	이상한 scanf */
#include <stdio.h>
int main()
{
	int num;
	char c;

	printf("숫자를 입력하세요 : ");
	scanf("%d", &num);

	printf("문자를 입력하세요 : ");
	scanf("%c", &c);
	return 0;
}