/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ASCII42.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/10 13:36:08 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/10 13:39:39 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* * 연산자 이용 */
// #include <stdio.h>

// int main()
// {
// 	int *p;
// 	int a;

// 	p = &a;
// 	a = 2;

// 	printf("a 의 값 : %d \n", a);
// 	printf("*p 의 값 : %d \n", *p);

// 	return (0);
// }

// #include <stdio.h>
// int main()
// {
// 	int *p;
// 	int a;

// 	p = &a;
// 	*p = 3;

// 	printf("a 의 값 : %d \n", a);
// 	printf("*p 의 값 : %d \n", *p);

// 	return 0;
// }