/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   inputToChar.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/05 03:06:19 by daehlee           #+#    #+#             */
/*   Updated: 2024/01/05 03:17:25 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 한 글자씩 입력받기 */
#include <stdio.h>

int main()
{
	FILE *fp = fopen("a.txt", "r");
	char c;

	while ((c = fgetc(fp)) != EOF)
	{
		printf("%c", c);
	}

	fclose(fp);
	return 0;
}