/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   subject.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: daehlee <daehlee@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/12/12 21:15:12 by daehlee           #+#    #+#             */
/*   Updated: 2023/12/12 21:17:20 by daehlee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 생각해보기 */

/* 문제 1 
	사용자로 부터 5 명의 학생의 수학, 국어, 영어 점수를 입력 받아서 평균이 가장
	높은 사람 부터 평균이 가장 낮은 사람까지 정렬되어 출력해봐라.
	평균을 기준으로 평균 이상인 사람 옆에는 '합격', 아닌 사람은 '불합격' 을 출력하라.
*/

/* 문제 2
	유클리도 호제법을 이용해서 N 개의 수들의 최대 공약수를 구하는 함수를 만들어봐라.
*/

/* 문제 3
	자기 자신을 호출하는 함수를 이용해서 1 부터 특정한 수까지의 곱을 구하는 프로그램을 만들어봐라.
*/

/* 문제 4
	
*/